import folium

# 제주도 중심 좌표
center_lat = 33.3617
center_lng = 126.5292

# 지도 생성
map = folium.Map(location=[center_lat, center_lng], zoom_start=10)

# 관광지 리스트
places = [
    {"name": "성산일출봉", "lat": 33.4588, "lng": 126.9426},
    {"name": "우도", "lat": 33.5069, "lng": 126.9531},
    {"name": "한라산", "lat": 33.3617, "lng": 126.5292},
    {"name": "제주성", "lat": 33.5136, "lng": 126.5295},
    {"name": "제주 돌문화공원", "lat": 33.5164, "lng": 126.5296},
    {"name": "표선해수욕장", "lat": 33.3179, "lng": 126.8253},
    {"name": "협재해수욕장", "lat": 33.3933, "lng": 126.2403},
    {"name": "오설록티뮤지엄", "lat": 33.3445, "lng": 126.8313},
    {"name": "제주 애월마을", "lat": 33.4649, "lng": 126.3185},
    {"name": "세화해수욕장", "lat": 33.3943, "lng": 126.2615},
    {"name": "함덕해수욕장", "lat": 33.5573, "lng": 126.6683},
    {"name": "휴애리자연생활공원", "lat": 33.3674, "lng": 126.3469},
    {"name": "제주 종달스카이워크", "lat": 33.5203, "lng": 126.7726},
    {"name": "사려니숲길", "lat": 33.2954, "lng": 126.2695},
    {"name": "협재원앤온리테마파크", "lat": 33.4015, "lng": 126.2402},
    {"name": "제주 신비의 도로", "lat": 33.2693, "lng": 126.6511},
    {"name": "김녕해수욕장", "lat": 33.5416, "lng": 126.7357},
    {"name": "산방산", "lat": 33.4523, "lng": 126.5499},
    {"name": "제주 테디베어박물관", "lat": 33.4591, "lng": 126.5686},
    {"name": "제주 국제공항", "lat": 33.5069, "lng": 126.4931},
    {"name": "애월해안도로", "lat": 33.4591, "lng": 126.3295},
    {"name": "디모자티", "lat": 33.2594, "lng": 126.4109},
    {"name": "제주 미술관", "lat": 33.2508, "lng": 126.4123},
    {"name": "비자림", "lat": 33.5135, "lng": 126.6459},
    {"name": "오름", "lat": 33.5205, "lng": 126.6552},
    {"name": "제주 세계자동차 박물관", "lat": 33.5137, "lng": 126.5264},
    {"name": "신창 풍차해안도로", "lat": 33.5026, "lng": 126.6949},
    {"name": "도두해안산책로", "lat": 33.4934, "lng": 126.5312},
    {"name": "행주산성", "lat": 33.5015, "lng": 126.5369},
    {"name": "제주 명진전통제과점", "lat": 33.4972, "lng": 126.5406}
]

# 관광지 마커 추가
for place in places:
    name = place["name"]
    lat = place["lat"]
    lng = place["lng"]
    folium.Marker(location=[lat, lng], popup=name).add_to(map)

# 지도 출력
map.save("jeju_map.html")
